УТ_для_edt/src/DataProcessors/смартПечатьЭтикеткиДоставки/смартПечатьЭтикеткиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартПечатьЭтикеткиДоставки</name>
  <comment>//++ #Б4248 смарт: Шляпников 16.09.2025 / Доставка товаров по заказу клиента, корректность заполнения, печать Этикетки доставки</comment>
</mdclass:DataProcessor>

УТ_для_edt/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаПеревозку</name>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаПланС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаПланПо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаФактС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаФактПо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.ТипыТранспортныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КурьерЭкспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПунктов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеВыполняет</name>
    <type>
      <types>EnumRef.ТипыИсполнителейЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПеревозчика</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдостоверениеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдостоверениеСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильГосударственныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильВместимостьВКубическихМетрах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильГрузоподъемностьВТоннах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаВид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаРегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <comment>//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля &quot;Вес&quot;. Разработка. </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЗоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доставлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЗначение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <comment>//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля &quot;Вес&quot;. Разработка. </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DefinedType.РаспоряжениеНаДоставку</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перевозчик</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолучательОтправитель</name>
      <type>
        <types>DefinedType.ОтправительПолучательДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоставляетсяПолностью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>смартТрекНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <comment>//++ #Б4398 смарт: Шляпников 02.10.2025 / Задания на перевозку. Заполнение поля &quot;Вес&quot;. Разработка. </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/DataProcessors/смартПечатьЭтикеткиДоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
// 		ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
// 		МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
// 		ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
// 		КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
// 		ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "смартЭтикеткаДоставки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, "смартЭтикеткаДоставки", НСтр("ru='Этикетка доставки'"),
			СформироватьПечатнуюФормуЭтикеткиДоставки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

#КонецОбласти

#Область АктОбОказанииУслуг

Функция СформироватьПечатнуюФормуЭтикеткиДоставки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_смартПечатьЭтикеткиДоставки";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.смартПечатьЭтикеткиДоставки.ПФ_MXL_ЭтикеткаДоставки");
	
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	МассивРеализаций = СтруктураТипов["Документ.РеализацияТоваровУслуг"];
	Если МассивРеализаций = Неопределено Тогда
		МассивРеализаций = Новый Массив;
	КонецЕсли;
	
	МассивПеремещений = СтруктураТипов["Документ.ПеремещениеТоваров"];
	Если МассивПеремещений = Неопределено Тогда
		МассивПеремещений = Новый Массив;
	КонецЕсли;
	
	МассивЗаданийНаПеревозку = СтруктураТипов["Документ.ЗаданиеНаПеревозку"];
	Если НЕ МассивЗаданийНаПеревозку = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение
		|ПОМЕСТИТЬ ВТРаспоряжения
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТРаспоряжения.Распоряжение КАК Реализация
		|ИЗ
		|	ВТРаспоряжения КАК ВТРаспоряжения
		|ГДЕ
		|	ВТРаспоряжения.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	ВТРаспоряжения КАК ВТРаспоряжения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВТРаспоряжения.Распоряжение = РеализацияТоваровУслуг.ЗаказКлиента
		|			И (РеализацияТоваровУслуг.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТРаспоряжения.Распоряжение КАК Перемещение
		|ИЗ
		|	ВТРаспоряжения КАК ВТРаспоряжения
		|ГДЕ
		|	ВТРаспоряжения.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПеремещениеТоваров.Ссылка
		|ИЗ
		|	ВТРаспоряжения КАК ВТРаспоряжения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|		ПО ВТРаспоряжения.Распоряжение = ПеремещениеТоваров.ЗаказНаПеремещение
		|			И (ПеремещениеТоваров.Проведен)";
		
		Запрос.УстановитьПараметр("Ссылка", МассивЗаданийНаПеревозку);
		
		Пакет = Запрос.ВыполнитьПакет();
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивРеализаций, Пакет[1].Выгрузить().ВыгрузитьКолонку("Реализация"), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПеремещений, Пакет[2].Выгрузить().ВыгрузитьКолонку("Перемещение"), Истина);
		
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Склад) КАК Склад,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента) КАК ЗаказКлиента,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.Номер) КАК Номер,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.ДатаОтгрузки) КАК ДатаОтгрузки,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.Контрагент) КАК Контрагент,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.Контрагент.ИНН) КАК КонтрагентИНН,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.Грузополучатель) КАК Грузополучатель,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.Грузополучатель.ИНН) КАК ГрузополучательИНН,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.АдресДоставки) КАК АдресДоставки,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.КонтактноеЛицо) КАК КонтактноеЛицо,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.смартТелефонКонтактногоЛица) КАК смартТелефонКонтактногоЛица,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.ПропускнаяСистема) КАК ПропускнаяСистема,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.ДополнительнаяОбработкаГрузаТранспортнойКомпанией) КАК ДополнительнаяОбработкаГрузаТранспортнойКомпанией,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.ПлатильщикЗаДоставкуГруза) КАК ПлатильщикЗаДоставкуГруза,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.СпособДоставкиТовара) КАК СпособДоставкиТовара,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.ПеревозчикПартнер) КАК ПеревозчикПартнер,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.АдресДоставкиПеревозчика) КАК АдресДоставкиПеревозчика,
	|	МАКСИМУМ(ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.ДополнительнаяИнформацияПоДоставке КАК СТРОКА(1000))) КАК ДополнительнаяИнформацияПоДоставке,
	|	МАКСИМУМ(ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.ОсобыеУсловияПеревозкиОписание КАК СТРОКА(1000))) КАК ОсобыеУсловияПеревозкиОписание,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента.Менеджер) КАК Менеджер,
	|	РеализацияТоваровУслугТовары.Ссылка.Автор КАК Автор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В(&МассивРеализаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка,
	|	ПеремещениеТоваров.СкладОтправитель,
	|	ПеремещениеТоваров.ЗаказНаПеремещение,
	|	ПеремещениеТоваров.Номер,
	|	ПеремещениеТоваров.ЗаказНаПеремещение.смартЖелаемаяДатаОтгрузкиАдмирал,
	|	ПеремещениеТоваров.Организация,
	|	ПеремещениеТоваров.Организация.ИНН,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ПеремещениеТоваров.ЗаказНаПеремещение.АдресДоставки,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ПеремещениеТоваров.ЗаказНаПеремещение.ПеревозчикПартнер,
	|	ПеремещениеТоваров.ЗаказНаПеремещение.АдресДоставкиПеревозчика,
	|	"""",
	|	"""",
	|	ПеремещениеТоваров.Ответственный,
	|	ПеремещениеТоваров.Ответственный
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивПеремещений)";
	
	Запрос.УстановитьПараметр("МассивРеализаций", МассивРеализаций);
	Запрос.УстановитьПараметр("МассивПеремещений", МассивПеремещений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");  

		ОбластьШапка.Параметры.Реализация = Выборка.Ссылка;
		ОбластьШапка.Параметры.ЗаказКлиента = Выборка.ЗаказКлиента;
		
		ОбластьШапка.Параметры.ДатаОтгрузки = Выборка.ДатаОтгрузки;
		ОбластьШапка.Параметры.Склад = Выборка.Склад;
		
		Если Выборка.Грузополучатель <> NULL И ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда
			ОбластьШапка.Параметры.Контрагент = Выборка.Грузополучатель;
			ОбластьШапка.Параметры.ИНН = Выборка.ГрузополучательИНН;
		Иначе
			ОбластьШапка.Параметры.Контрагент = Выборка.Контрагент;
			ОбластьШапка.Параметры.ИНН = Выборка.КонтрагентИНН;
		КонецЕсли;
		
		ОбластьШапка.Параметры.АдресДоставки = Выборка.АдресДоставки;
		ОбластьШапка.Параметры.КонтактноеЛицо = Выборка.КонтактноеЛицо;
		ОбластьШапка.Параметры.смартТелефонКонтактногоЛица = Выборка.смартТелефонКонтактногоЛица;
		ОбластьШапка.Параметры.ПропускнаяСистема = Выборка.ПропускнаяСистема;
		ОбластьШапка.Параметры.ДополнительнаяОбработкаГрузаТранспортнойКомпанией = Выборка.ДополнительнаяОбработкаГрузаТранспортнойКомпанией;
		ОбластьШапка.Параметры.ПлатильщикЗаДоставкуГруза = Выборка.ПлатильщикЗаДоставкуГруза;
		ОбластьШапка.Параметры.СпособДоставкиТовара = Выборка.СпособДоставкиТовара;
		ОбластьШапка.Параметры.ПеревозчикПартнер = Выборка.ПеревозчикПартнер;
		ОбластьШапка.Параметры.АдресДоставкиПеревозчика = Выборка.АдресДоставкиПеревозчика;
		ОбластьШапка.Параметры.ДополнительнаяИнформацияПоДоставке = Выборка.ДополнительнаяИнформацияПоДоставке;
		ОбластьШапка.Параметры.ОсобыеУсловияПеревозкиОписание = Выборка.ОсобыеУсловияПеревозкиОписание;
		ОбластьШапка.Параметры.Менеджер = Выборка.Менеджер;
		ОбластьШапка.Параметры.Автор = Выборка.Автор;
			
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область Прочее

#КонецОбласти

#КонецОбласти

#КонецЕсли
